# <center><u>Pandas <u> </center>

## 1.[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

resource - https://www.youtube.com/watch?v=m7gxnZx2vT4

<p style='text-align: right;'> 1*4=4 points</p>

Import pandas and numpy with their aliases

In [1]:
import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a= pd.Series([100,200,300,400])
a

0    100
1    200
2    300
3    400
dtype: int64

Print a, and data type

In [3]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [4]:
a[2]

300

What are the values of index for series a?

<p style='text-align: right;'> 2*4 = 8 points</p>

In [5]:
print(a.index)

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [6]:
index1 = ['c','a','b','d']
a.index=index1
print(a.index)

Index(['c', 'a', 'b', 'd'], dtype='object')

Access the value in the series with index 'd'

In [7]:
a['d']

400

Sort the values wrt to the index and print it

In [8]:
a.sort_index()

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

<p style='text-align: right;'> 4*2=8 points</p>

In [9]:
b=pd.Series([800,450,100],index=['e','f','g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [10]:
a.append(b)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

In [11]:
#print a again after appending b into it
a.append(b).sort_index()

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
z=a.append(b).sort_values(ascending =False )
z

e    800
f    450
d    400
b    300
a    200
g    100
c    100
dtype: int64

In [13]:
# print index of a

print(z.index)

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

## 2. [Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

Reference:-https://www.youtube.com/watch?v=KB-19V-cSs4

<p style='text-align: right;'> 8*2 = 16 points</p>

### Part 1

<p style='text-align: right;'> 5 points</p>

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [14]:
df =pd.DataFrame(z)
print(df)
print(type(df))

     0
e  800
f  450
d  400
b  300
a  200
g  100
c  100
<class 'pandas.core.frame.DataFrame'>

Point to ponder! Don't you think series a and dataframe df looks alike? But there must be some difference between them. 
Hey buddy think and write your thoughts below.

In [15]:
# happy to know your comment
# Columns and rows in df where series a has only row : that is one dimensional, df is basically combination of series ( which makes column of df)

<p style='text-align: right;'> 2 + 1*4 = 6 points</p>

What is the shape of the datafarme <br>

In [16]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a' ?

In [17]:
df.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [18]:
#head
df.head() #top records

     0
e  800
f  450
d  400
b  300
a  200

In [19]:
#tail
df.tail() #bottom records

     0
d  400
b  300
a  200
g  100
c  100

Rename the columns of the dataframe as 'points'

<p style='text-align: right;'> 2 points</p>

In [20]:
df.columns= ['points']
df

   points
e     800
f     450
d     400
b     300
a     200
g     100
c     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

<p style='text-align: right;'> 5 points</p>

In [21]:
#Create fruits array
fruits = np.array(['orange','mango','orange','apple','apple','mango','orange'])
# i don not know the method to select n random itesm from a list for creating array
fruits

array(['orange', 'mango', 'orange', 'apple', 'apple', 'mango', 'orange'],
      dtype='<U6')

The above output might vary based randomness

In [22]:
#Create series fruits out of fruits array
pd.Series(fruits)

0    orange
1     mango
2    orange
3     apple
4     apple
5     mango
6    orange
dtype: object

Change the index of fruits to the index of dataframe df

<p style='text-align: right;'> 5 points</p>

In [23]:
pd.Series(fruits, index = df.index)

e    orange
f     mango
d    orange
b     apple
a     apple
g     mango
c    orange
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits' <br> print the head of the dataframe to verify

In [24]:
df['fruits']=pd.Series(fruits, index = df.index)
df

   points  fruits
e     800  orange
f     450   mango
d     400  orange
b     300   apple
a     200   apple
g     100   mango
c     100  orange

<u>Bonus optional question:</u> <br>
What if we had to changed the index of the dataframe? <br>
Try to add any series to the dataframe with the origianl index (when index of series is not same as to the index of dataframe)

Use series as pd.Series([100,200,300,400,500,600,700]) and try to add it to df with column name Bonus_number.

Bonus marks: 5 points

In [25]:
#bonus code here
df['Bonus_number']=pd.Series([100,200,300,400,500,600,700]) 
df
#need to add same index here 
# df['Bonus_number']=pd.Series([100,200,300,400,500,600,700],index = df.index) 
# df
#with the original index series can not be added need to change the index as per the data fram to which series need to added

   points  fruits  Bonus_number
e     800  orange           NaN
f     450   mango           NaN
d     400  orange           NaN
b     300   apple           NaN
a     200   apple           NaN
g     100   mango           NaN
c     100  orange           NaN

### Part 2
Reference:- https://www.youtube.com/watch?v=yPVQZZmheCg

Create a dataframe  d1 where the columns are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

<p style='text-align: right;'> 2*5=10 points</p>

In [26]:
d1=pd.DataFrame({"city":['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ],"Temperature":[15, 22, 20, 26,-2]})

Print d1

In [27]:
d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [28]:
d1.shape

(5, 2)

Set city = d1['city']

In [29]:
city = d1['city']

print city <br>
What is the type of city.

In [30]:
print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object
<class 'pandas.core.series.Series'>

Create another dataframe d2 where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

<p style='text-align: right;'> 3+2+5 = 10 points</p>

In [31]:
d2=pd.DataFrame({"city":['Bengalaru','Coimbatore','Srirangam','Pondicherry' ],"Temperature":[24,35,36,39]})

print the shape of this dataframe

In [32]:
print(d2)
print(d2.shape)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39
(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [33]:
d3= pd.concat([d1,d2], ignore_index=True, axis= 0)
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
5    Bengalaru           24
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

# fun fact at high level

1. .concat() simply stacks multiple DataFrame together either vertically, or stitches horizontally after aligning on index
2. .merge() first aligns two DataFrame' selected common column(s) or index, and then pick up the remaining columns from the aligned rows of each DataFrame

Do you know about join function? This interesting quest we give to you to find.

Select the part of the dataframe such that it contains cities where temp is less then or equal to 20 <br>
How many cities are there?

<p style='text-align: right;'> 5+5=10 points</p>

In [34]:
d4=d3[d3['Temperature']<=20]
d4

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [35]:
d5=d3[d3['Temperature']>=35]
d5

          city  Temperature
6   Coimbatore           35
7    Srirangam           36
8  Pondicherry           39

## 3. Applying functions to columns and creating new columns

Reference: https://www.youtube.com/watch?v=L0wMml__Gow

<p style='text-align: right;'> 20 points</p>

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [36]:
# ,'Pondicherry','Delhi'])

In [37]:
# write function here
d3['ut_city']= d3['city'].apply(lambda x : True if (x == 'Chandigarh' or x=='Pondicherry' or x=='Delhi') else False )

#i have one question here cant we look like this - whats the wrong here 
# d3['ut_city']= d3['city'].apply(lambda x : True if x.isin(['Chandigarh','Pondicherry','Delhi']) else False )

In [38]:
#print d3
d3

          city  Temperature  ut_city
0   Chandigarh           15     True
1        Delhi           22     True
2       Kanpur           20    False
3      Chennai           26    False
4       Manali           -2    False
5    Bengalaru           24    False
6   Coimbatore           35    False
7    Srirangam           36    False
8  Pondicherry           39     True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [85]:
# write function here
def c_to_f(x):
    y=x*(9/5)+32
    return y

In [86]:
# check  function c_to_f(10)
c_to_f(10)

50.0

In [87]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['temp_farenhiet']=d3['Temperature'].apply(lambda x : c_to_f(x))     # please check both the ways ?
# d3['temp_farenhiet']= d3['Temperature'].apply(lambda x : x*(9/5)+32)
d3

          city  Temperature  ut_city  temp_farenhiet
0   Chandigarh           15     True            59.0
1        Delhi           22     True            71.6
2       Kanpur           20    False            68.0
3      Chennai           26    False            78.8
4       Manali           -2    False            28.4
5    Bengalaru           24    False            75.2
6   Coimbatore           35    False            95.0
7    Srirangam           36    False            96.8
8  Pondicherry           39     True           102.2

## 4. Indexing and selecting rows in DataFrame

Reference:-https://www.youtube.com/watch?v=XKFRFDgA7ZY

<p style='text-align: right;'> 20 points</p>

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [45]:
subset_d= d3[d3['ut_city']== True]
subset_d

          city  Temperature  ut_city  temp_farenhiet
0   Chandigarh           15     True            59.0
1        Delhi           22     True            71.6
8  Pondicherry           39     True           102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [46]:
subset_d2= d3[d3['temp_farenhiet']> 90]
subset_d2

          city  Temperature  ut_city  temp_farenhiet
6   Coimbatore           35    False            95.0
7    Srirangam           36    False            96.8
8  Pondicherry           39     True           102.2

Select only the first three rows of the dataframe d1.

In [60]:
# subset_d3= d3[0:3]
# subset_d3
# OR
d3.iloc[0:3,:]

         city  Temperature  ut_city  temp_farenhiet
0  Chandigarh           15     True            59.0
1       Delhi           22     True            71.6
2      Kanpur           20    False            68.0

Select all the rows and last two columns in the dataframe.

In [58]:
subset_d3=d3.iloc[:,-2:]
subset_d3

   ut_city  temp_farenhiet
0     True            59.0
1     True            71.6
2    False            68.0
3    False            78.8
4    False            28.4
5    False            75.2
6    False            95.0
7    False            96.8
8     True           102.2

## 5. Reading csv file and group by

Reference: https://www.youtube.com/watch?v=ENhGz1HkzvY <br>
https://www.youtube.com/watch?v=nulx_VmV7dE

<p style='text-align: right;'> 2*2=4 points</p>

Tutorial for how to load csv file in colab - https://www.youtube.com/watch?v=6HFlwqK3oeo

Read the file 'weather_data.csv' and store it in a pandas dataframe 'df'

In [66]:
df= pd.read_csv('weather_data.csv')
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

print the shape and head of the dataframe

In [64]:
df.shape

(6, 4)

Group the dataframe wrt to 'event' and save the resulting output in a variable named 'g'

<p style='text-align: right;'> 5*3 = 15 points</p>

In [68]:
g=df.groupby(df['event'])
g

Print g and  type(g)

In [70]:
print(list(df.groupby(df['event'])))
print(type(g))

[('Rain',         day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain), ('Snow',         day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow), ('Sunny',         day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
5  1/6/2017           31          2  Sunny)]
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Iterate over all the temperatures in g and print them

In [79]:
# is it like print(list(df.groupby(df['event'])))

Use the describle method on g to get the complete description on it.

In [78]:
(df.groupby(df['event'])).describe()

      temperature                                               windspeed  \
            count  mean       std   min   25%   50%   75%   max     count
event
Rain          2.0  32.0  0.000000  32.0  32.0  32.0  32.0  32.0       2.0
Snow          2.0  26.0  2.828427  24.0  25.0  26.0  27.0  28.0       2.0
Sunny         2.0  33.0  2.828427  31.0  32.0  33.0  34.0  35.0       2.0


      mean       std  min   25%  50%   75%  max
event
Rain   5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

Create a new column in the dataframe df, named 'hot_temp' which contains True if temp is above 30, else False

<p style='text-align: right;'> 5 points</p>

In [83]:
#code here to filter df with above condition
df['hot_temp']=df['temperature'].apply(lambda x:  True if x>30 else False)

In [84]:
# print df
df

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

## Data Range

Reference:-https://www.youtube.com/watch?v=dRxCvSbMEto

<p style='text-align: right;'> 5*3 = 15 points</p>

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [88]:
a= pd.date_range(start='2020-01-01',end='2021-04-01')

print a

In [89]:
a

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [90]:
len(a)

457

What is the type of a?

In [91]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

________________
# Hey high five! You solved the 4th milestone challenge too! Pawri to banti hai ;)
________________

# FeedBack
We hope you’ve enjoyed this course so far. We’re committed to helping you use AIforAll course to its full potential so you can grow with us. And that’s why we need your help in form of a feedback here

We appreciate your time for your thoughtful comment below

Space to comment:

<br> nice set of examples ; thanks for such a great excercises with you tube references

**Rate the following in the scale of 1 to 10**

Assignment Difficulty Level

**Rate**:7

Question Clarity Level

**Rate**:9

YouTube video content quality.

**Rate**: 9

**Thanks**